Revit 2027 API
EdgeArrayArray.Insert Method
Insert the specified edge array into the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	EdgeArray item,
	int index
)
Public Overridable Sub Insert (
	item As EdgeArray,
	index As Integer
)
public:
virtual void Insert(
	EdgeArray^ item,
	int index
)
abstract Insert :
        item : EdgeArray *
        index : int -> unit
override Insert :
        item : EdgeArray *
        index : int -> unit
Parameters
item EdgeArray
The edge array to be inserted into the array.
index Int32
The edge array will be inserted before this index.
Return Value
Returns whether the edge array was inserted into the array.
See Also
Reference
EdgeArrayArray Class
Autodesk.Revit.DB Namespace